InformationRegisters/ЧатСессииСКлиентом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЧатСессииСКлиентом</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Закрытие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сессия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Отправители</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЧатСессииСКлиентом/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция НовыйНомерСессии(Клиент) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧатСессииСКлиентомСрезПоследних.Сессия КАК Сессия,
		|	ЧатСессииСКлиентомСрезПоследних.Закрытие КАК Закрытие,
		|	ЧатСессииСКлиентомСрезПоследних.Период КАК Период
		|ИЗ
		|	РегистрСведений.ЧатСессииСКлиентом.СрезПоследних(, Клиент = &Клиент) КАК ЧатСессииСКлиентомСрезПоследних";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Номер = 1;
	Пока Выборка.Следующий() Цикл
		
		Номер = Выборка.Сессия;
		Если Выборка.Закрытие
			Или НачалоДня(Выборка.Период) < НачалоДня(ТекущаяДатаСеанса()) Тогда
		
			Номер = Номер + 1;
		
		КонецЕсли;
		
	КонецЦикла;

	Возврат Номер;

КонецФункции // ()

#КонецОбласти

#Область ОбработчикиСобытий



#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти
